---
title: RebarShapeParameters
classe: Autodesk.Revit.DB.Structure.RebarShapeParameters
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# RebarShapeParameters

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `rebarShapeParameters.IsValidObject` | Boolean |
| `Void Dispose()` | `rebarShapeParameters.Dispose()` | Void |
| `IList<ElementId> GetAllRebarShapeParameters(Document)` | `RebarShapeParameters.GetAllRebarShapeParameters(doc)` | IList<ElementId> |
| `ElementId GetElementIdForExternalDefinition(Document, ExternalDefinition)` | `RebarShapeParameters.GetElementIdForExternalDefinition(doc, externalDefinition)` | ElementId |
| `ExternalDefinition GetExternalDefinitionForElementId(Document, ElementId, DefinitionFile)` | `RebarShapeParameters.GetExternalDefinitionForElementId(doc, paramId, definitionFile)` | ExternalDefinition |
| `ElementId GetOrCreateElementIdForExternalDefinition(Document, ExternalDefinition)` | `RebarShapeParameters.GetOrCreateElementIdForExternalDefinition(doc, externalDefinition)` | ElementId |
| `Boolean IsValidExternalDefinition(ExternalDefinition)` | `RebarShapeParameters.IsValidExternalDefinition(param)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```